Revit 2024 API
ParameterTypeId.ViewTemplateForSchedule Property
 "View Template"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId ViewTemplateForSchedule { get; }
Visual Basic
Public Shared ReadOnly Property ViewTemplateForSchedule As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ViewTemplateForSchedule {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace